Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбменаСКонтролирующимиОрганами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьВидыОбменаСКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОбменаСКонтролирующимиОрганами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКодФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код органа Федеральной службы государственной статистики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодчиненностиФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрупнейшийНалогоплательщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТерриториальногоОрганаПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТерриториальногоОрганаФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>135</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменКаталогОтправкиДанныхОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменКаталогПрограммыЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменКодАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьРайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьСевернуюНадбавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФСС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьУчетныеЗаписиДокументооборота</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиДокументооборота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКФС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКФС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполнятьПодразделенияВМероприятияхТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерСФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияСтрахователяФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииСтрахователейФизическихЛицСФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменДаннымиУниверсальныйФормат/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обмен данными через универсальный формат Enterprise Data.
// Серверные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбменДанными

// См. ОбменДаннымиПереопределяемый.ПриПолученииДоступныхВерсийФормата
Процедура ПриПолученииДоступныхВерсийФормата(ВерсииФормата, ВариантНастройки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ВариантНастройки) Тогда
		ВерсииФормата.Вставить("1.3", МенеджерОбменаЧерезУниверсальныйФормат13);
		ВерсииФормата.Вставить("1.8", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.10", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.11", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.15", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.17", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.20", МенеджерОбменаЧерезУниверсальныйФормат);
	Иначе
		
		Если ВариантНастройки = ВариантНастройкиОбменаERP()
			Или ВариантНастройки = ВариантНастройкиОбменУниверсальный() Тогда
			ВерсииФормата.Вставить("1.3", МенеджерОбменаЧерезУниверсальныйФормат13);
		КонецЕсли;
		
		Если ВариантНастройки = ВариантНастройкиОбменаERP()
			Или ВариантНастройки = ВариантНастройкиОбменУниверсальный()
			Или ВариантНастройки = ВариантНастройкиОбменаБП() Тогда
			ВерсииФормата.Вставить("1.8", МенеджерОбменаЧерезУниверсальныйФормат);
			ВерсииФормата.Вставить("1.10", МенеджерОбменаЧерезУниверсальныйФормат);
			ВерсииФормата.Вставить("1.11", МенеджерОбменаЧерезУниверсальныйФормат);
			ВерсииФормата.Вставить("1.15", МенеджерОбменаЧерезУниверсальныйФормат);
		КонецЕсли;
		
		ВерсииФормата.Вставить("1.17", МенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.20", МенеджерОбменаЧерезУниверсальныйФормат);
		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбменДанными

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьИмяВариантаНастройкиДО");
	Методы.Вставить("ЗаполнитьНастройкиУсловийОбмена");
	Методы.Вставить("ОбновитьНастройкуИспользуетсяОбмен");
	Методы.Вставить("ОбновитьНастройкиВыгрузкиВедомостейПроводок");
	Методы.Вставить("ЗаполнитьНастройкиОтправлятьСотрудников");
	Методы.Вставить("ЗарегистрироватьДанныеПоСотрудникам", Истина);
КонецПроцедуры

#КонецОбласти

// Возвращает признак существования настроенной синхронизации с конфигурацией "1С:ERP Управление предприятием 2".
// Параметры:
//   УдаляемыйУзел - ПланОбменаСсылка - Ссылка на удаляемый узел обмена.
// Возвращаемое значение:
//   Булево - Истина, если есть хотя бы одна настроенная синхронизация с "1С:ERP Управление предприятием 2".
//
Функция ИспользуетсяОбменУправлениеПредприятием2(УдаляемыйУзел = Неопределено) Экспорт
	
	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить(ВариантНастройкиОбменаERP());
	Запрос = ЗапросУзлыОбмена(МассивВариантов);

	ЕстьОбменСУправлениеПредприятием = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не УдаляемыйУзел = Неопределено Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка = УдаляемыйУзел Тогда
				Продолжить;
			КонецЕсли;
			ЕстьОбменСУправлениеПредприятием = Истина;
			Прервать;
		КонецЦикла;
	Иначе
		Если Выборка.Следующий() Тогда
			ЕстьОбменСУправлениеПредприятием = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОбменСУправлениеПредприятием;
	
КонецФункции

// Возвращает признак выгрузки ведомостей как заявок.
//
// Возвращаемое значение:
//   Булево - Истина, если есть хотя бы одна настроенная синхронизация с с выгрузкой ведомостей как заявок.
//
Функция ВедомостиВыгружаютсяКакЗаявки() Экспорт

	Запрос = ЗапросУзлыОбмена();

	ОтправлятьВедомостиКакЗаявки = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтправлятьВедомостиКакЗаявки = ОтправлятьВедомостиКакЗаявки Или Выборка.ОтправлятьВедомостиКакЗаявки;
	КонецЦикла;
	
	Возврат ОтправлятьВедомостиКакЗаявки;

КонецФункции

// Обработчик регистрации изменений для начальной выгрузки данных.
// 
// см. ОбменДаннымиПереопределяемый.РегистрацияИзмененийНачальнойВыгрузкиДанных()
//
Процедура РегистрацияИзмененияДляНачальнойВыгрузки(Знач Получатель, СтандартнаяОбработка, Отбор) Экспорт
	
	Если ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Получатель) = "СинхронизацияДанныхЧерезУниверсальныйФормат" Тогда
		РегистрацияИзмененияДляНачальнойВыгрузкиДанных(Получатель, СтандартнаяОбработка, Отбор);
	КонецЕсли;
	
КонецПроцедуры

// Определяет использование обмена данными с БП3.
// Если в параметрах указана организация, то вычисляется использование обмена по этой организации, иначе по всем или любой.
//
// Параметры:
//	Организация - СправочникСсылка.Организации, Неопределено - организация, для которой определяется использование обмена.
//
// Возвращаемое значение:
// 		Булево - Истина если обмен используется, Ложь - в противном случае.
//
Функция ИспользуетсяОбменБП3(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантНастройки", ВариантНастройкиОбменаБП());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ИспользоватьОтборПоОрганизациям КАК ИспользоватьОтборПоОрганизациям
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки = &ВариантНастройки";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатаЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатаЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Организация = Неопределено Тогда
		Возврат Истина;
	Иначе
		Выборка = РезультатаЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ИспользоватьОтборПоОрганизациям Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Узлы", РезультатаЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФорматОрганизации.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Организации КАК СинхронизацияДанныхЧерезУниверсальныйФорматОрганизации
	|ГДЕ
	|	СинхронизацияДанныхЧерезУниверсальныйФорматОрганизации.Ссылка В(&Узлы)
	|	И СинхронизацияДанныхЧерезУниверсальныйФорматОрганизации.Организация = &Организация";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатаЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Не РезультатаЗапроса.Пустой();
	
КонецФункции

// Возвращает настройки обмена с БП3.
//
// Возвращаемое значение:
//		Структура - настройки обмена, структура с ключами
// 			* ИспользуетсяОбменПоВсемОрганизациям - Булево
// 			* ИспользуетсяОбменПоОрганизациям - Булево
// 			* ИспользованиеОбменаПоОрганизациям - Соответствие
//
Функция НастройкиОбменаБП3() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("ИспользуетсяОбменПоВсемОрганизациям", Ложь);
	Настройки.Вставить("ИспользуетсяОбменПоОрганизациям", Ложь);
	Настройки.Вставить("ИспользованиеОбменаПоОрганизациям", Новый Соответствие);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантНастройки", ВариантНастройкиОбменаБП());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ИспользоватьОтборПоОрганизациям КАК ИспользоватьОтборПоОрганизациям
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки = &ВариантНастройки";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатаЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если РезультатаЗапроса.Пустой() Тогда
		Возврат Настройки;
	КонецЕсли;
	
	Выборка = РезультатаЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИспользоватьОтборПоОрганизациям Тогда
			Настройки.ИспользуетсяОбменПоОрганизациям = Истина;
		КонецЕсли;
	КонецЦикла;
	Настройки.ИспользуетсяОбменПоВсемОрганизациям = Не Настройки.ИспользуетсяОбменПоОрганизациям;
	
	Если Настройки.ИспользуетсяОбменПоВсемОрганизациям Тогда
		Возврат Настройки;
	КонецЕсли;
	
	ОбменПоОрганизациям = Новый Соответствие;
	ОбменПоОрганизациям.Вставить(Справочники.Организации.ПустаяСсылка(), Ложь);
	
	Запрос.УстановитьПараметр("Узлы", РезультатаЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА УзлыОбмена.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОбменИспользуется
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Организации КАК УзлыОбмена
	|		ПО (УзлыОбмена.Организация = Организации.Ссылка)
	|ГДЕ
	|	УзлыОбмена.Ссылка В(&Узлы)";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить(); 
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбменПоОрганизациям.Вставить(Выборка.Ссылка, Выборка.ОбменИспользуется);
	КонецЦикла;
	Настройки.ИспользованиеОбменаПоОрганизациям = ОбменПоОрганизациям;
	
	Возврат Настройки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.16.36";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиУниверсальныйФормат.ОбновитьНастройкиВыгрузкиВедомостейПроводок";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.19.74";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиУниверсальныйФормат.ОбновитьНастройкуИспользуетсяОбмен";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.31.3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиУниверсальныйФормат.ЗаполнитьНастройкиУсловийОбмена";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.35.63";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиУниверсальныйФормат.ЗаполнитьНастройкиОтправлятьСотрудников";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.36.61";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ОбменДаннымиУниверсальныйФормат.ОбновитьИмяВариантаНастройкиДО";
	
КонецПроцедуры

Процедура ОбновитьНастройкиВыгрузкиВедомостейПроводок() Экспорт

	Запрос = Новый Запрос;
	ВариантыНастроек = Новый Массив;
	ВариантыНастроек.Добавить(ВариантНастройкиОбменаERP());
	Запрос.УстановитьПараметр("ВариантыНастроек", ВариантыНастроек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки КАК ВариантНастройки,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ДанныеДляФормированияПроводокОтправлятьСводно КАК ДанныеДляФормированияПроводокОтправлятьСводно
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки В(&ВариантыНастроек)
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ДанныеДляФормированияПроводокОтправлятьСводно";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УзелОбъект.ДанныеДляФормированияПроводокОтправлятьСводно = Истина;
		УзелОбъект.ОтправлятьВедомости = Истина;
		УзелОбъект.ОтправлятьВедомостиКакЗаявки = Истина;
		УзелОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьНастройкуИспользуетсяОбмен() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел";
	ОбменНастроен = Не Запрос.Выполнить().Пустой();
	
	Если Константы.ИспользуетсяОбменДаннымиУниверсальныйФормат.Получить() <> ОбменНастроен Тогда
		МенеджерКонстанты = Константы.ИспользуетсяОбменДаннымиУниверсальныйФормат.СоздатьМенеджерЗначения();
		МенеджерКонстанты.Значение = ОбменНастроен;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиУсловийОбмена() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантНастройки", ВариантНастройкиОбменаБП());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК Таблица
	|ГДЕ
	|	Таблица.ВариантНастройки = &ВариантНастройки
	|	И НЕ Таблица.ПометкаУдаления
	|	И НЕ Таблица.ЭтотУзел
	|	И (Таблица.ОтправлятьВсехФизическихЛиц
	|			ИЛИ НЕ Таблица.ОтправлятьБухучет
	|			ИЛИ НЕ Таблица.ОтправлятьСтатистикуПерсонала
	|			ИЛИ НЕ Таблица.ОтправлятьУдержанныйНДФЛ
	|			ИЛИ НЕ Таблица.ОтправлятьРезервы
	|			ИЛИ Таблица.ОтправлятьВидыРабот
	|			ИЛИ Таблица.ОтправлятьВсеДолжности
	|			ИЛИ НЕ Таблица.ОтправлятьРегистрацииНО
	|			ИЛИ Таблица.ОтправлятьСтруктуруПредприятия)";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УзелОбъект.ОтправлятьВсехФизическихЛиц 	= Ложь;
			УзелОбъект.ОтправлятьБухучет 			= Истина;
			УзелОбъект.ОтправлятьСтатистикуПерсонала = Истина;
			УзелОбъект.ОтправлятьУдержанныйНДФЛ 	= Истина;
			УзелОбъект.ОтправлятьРезервы 			= Истина;
			УзелОбъект.ОтправлятьВидыРабот 			= Ложь;
			УзелОбъект.ОтправлятьВсеДолжности 		= Ложь;
			УзелОбъект.ОтправлятьРегистрацииНО 		= Истина;
			УзелОбъект.ОтправлятьСтруктуруПредприятия = Ложь;
			УзелОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
	ВариантыНастройки = Новый Массив;
	ВариантыНастройки.Добавить(ВариантНастройкиОбменаERP());
	ВариантыНастройки.Добавить(ВариантНастройкиОбменУниверсальный());
	Запрос.УстановитьПараметр("ВариантыНастройки", ВариантыНастройки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК Таблица
	|ГДЕ
	|	Таблица.ВариантНастройки В(&ВариантыНастройки)
	|	И НЕ Таблица.ПометкаУдаления
	|	И НЕ Таблица.ЭтотУзел
	|	И (НЕ Таблица.ОтправлятьВсехФизическихЛиц
	|			ИЛИ НЕ Таблица.ОтправлятьБухучет
	|			ИЛИ НЕ Таблица.ОтправлятьСтатистикуПерсонала
	|			ИЛИ НЕ Таблица.ОтправлятьУдержанныйНДФЛ
	|			ИЛИ НЕ Таблица.ОтправлятьРезервы
	|			ИЛИ НЕ Таблица.ОтправлятьВидыРабот
	|			ИЛИ Таблица.ОтправлятьВсеДолжности
	|			ИЛИ НЕ Таблица.ОтправлятьРегистрацииНО
	|			ИЛИ НЕ Таблица.ОтправлятьСтруктуруПредприятия)";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УзелОбъект.ОтправлятьВсехФизическихЛиц 	= Истина;
			УзелОбъект.ОтправлятьБухучет 			= Истина;
			УзелОбъект.ОтправлятьСтатистикуПерсонала = Истина;
			УзелОбъект.ОтправлятьУдержанныйНДФЛ 	= Истина;
			УзелОбъект.ОтправлятьРезервы 			= Истина;
			УзелОбъект.ОтправлятьВидыРабот 			= Истина;
			УзелОбъект.ОтправлятьВсеДолжности 		= Ложь;
			УзелОбъект.ОтправлятьРегистрацииНО 		= Истина;
			УзелОбъект.ОтправлятьСтруктуруПредприятия = Истина;
			УзелОбъект.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьНастройкиОтправлятьСотрудников() Экспорт

	Запрос = Новый Запрос;
	ВариантыНастроек = Новый Массив;
	ВариантыНастроек.Добавить(ВариантНастройкиОбменаДО());
	Запрос.УстановитьПараметр("ВариантыНастроек", ВариантыНастроек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки В(&ВариантыНастроек)
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ОтправлятьСотрудников";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УзелОбъект.ОтправлятьСотрудников = Истина;
		УзелОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьИмяВариантаНастройкиДО() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантНастройки", "ОбменДОЗУП");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки = &ВариантНастройки";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		УзелОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УзелОбъект.ВариантНастройки = ОбменДаннымиУниверсальныйФормат.ВариантНастройкиОбменаДО();
		УзелОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывается при записи настройки синхронизации данных через универсальный формат.
// Используется для обновления настроек использования обмена с определенным корреспондентом.
//
// Параметры:
//    ПланОбменаОбъект - ПланОбменаОбъект.СинхронизацияДанныхЧерезУниверсальныйФормат - записываемый узел плана обмена.
//    ЭтоУдаление - Булево - признак того, что выполняется пометка на удаление или непосредственное удаление узла.
//
Процедура ОбновитьНастройкиИспользованияОбмена(ПланОбменаОбъект, ЭтоУдаление) Экспорт
	
	Если ПланОбменаОбъект.ЭтотУзел Тогда
		Возврат;
	КонецЕсли;

	ОбменНастроен = Истина;
	Если ЭтоУдаление Тогда
		ОбменНастроен = Не ЗапросУзлыОбмена(,ПланОбменаОбъект.Ссылка).Выполнить().Пустой();
	КонецЕсли;
	Если Константы.ИспользуетсяОбменДаннымиУниверсальныйФормат.Получить() <> ОбменНастроен Тогда
		Константы.ИспользуетсяОбменДаннымиУниверсальныйФормат.Установить(ОбменНастроен);
	КонецЕсли;
	
	// Обмен с 1С:ERP Управление предприятием 2.
	ОбменНастроенУП2 = Ложь;
	Если ЭтоУдаление Тогда
		ОбменНастроенУП2 = ИспользуетсяОбменУправлениеПредприятием2(ПланОбменаОбъект.Ссылка);
	Иначе
		ОбменНастроенУП2 = ИспользуетсяОбменУправлениеПредприятием2();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Модуль.ОбновитьНастройкиСтруктурыПредприятияПриИспользованииОбменаУП2(ОбменНастроенУП2);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросУзлыОбмена(МассивВариантов = Неопределено, ИсключаемыйУзел = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка КАК Ссылка,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ОтправлятьВедомостиКакЗаявки КАК ОтправлятьВедомостиКакЗаявки,
	|	СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки КАК ВариантНастройки
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК СинхронизацияДанныхЧерезУниверсальныйФормат
	|ГДЕ
	|	НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ПометкаУдаления
	|	И НЕ СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел
	|	И &УсловиеЗапроса
	|	И &УсловиеУзел";
	
	Если МассивВариантов = Неопределено Тогда
		УсловиеЗапроса = "ИСТИНА";
	Иначе
		УсловиеЗапроса = "СинхронизацияДанныхЧерезУниверсальныйФормат.ВариантНастройки В(&МассивВариантов)";
		Запрос.УстановитьПараметр("МассивВариантов", МассивВариантов);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЗапроса", УсловиеЗапроса);
	Если ИсключаемыйУзел = Неопределено Тогда
		УсловиеУзел = "ИСТИНА";
	Иначе
		УсловиеУзел = "СинхронизацияДанныхЧерезУниверсальныйФормат.Ссылка <> &ИсключаемыйУзел";
		Запрос.УстановитьПараметр("ИсключаемыйУзел", ИсключаемыйУзел);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеУзел", УсловиеУзел);
	
	Возврат Запрос;
КонецФункции

Процедура ЗарегистрироватьДанныеПоСотрудникам(Параметры) Экспорт
	
	Получатель = Параметры.Получатель;
	Организации = Параметры.Организации;
	ЕстьОтборПоОрганизациям = (Организации <> Неопределено);
	
	Выборка = ВыборкаСотрудниковПоОрганизациям(Организации, ЕстьОтборПоОрганизациям);
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
	КонецЦикла;
	
	МДРегистры = Новый Массив;
	МДРегистры.Добавить(Метаданные.РегистрыСведений.КадроваяИсторияСотрудников);
	МДРегистры.Добавить(Метаданные.РегистрыСведений.ВидыЗанятостиСотрудников);
	Для каждого ОбъектМетаданных Из МДРегистры Цикл
		ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
		Если ЕстьОтборПоОрганизациям Тогда
			Регистраторы = РегистраторыПоОрганизациям(ОбъектМетаданных, Организации);
			Для каждого Регистратор Из Регистраторы Цикл
				НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).СоздатьНаборЗаписей();
				НаборЗаписей.Отбор["Регистратор"].Значение = Регистратор;
				НаборЗаписей.Отбор["Регистратор"].Использование = Истина;
				ПланыОбмена.ЗарегистрироватьИзменения(Получатель, НаборЗаписей);
			КонецЦикла;
		Иначе
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, ОбъектМетаданных);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик регистрации изменений для начальной выгрузки данных с отбором по организации.
//
// Параметры:
//
// Получатель - ПланОбменаСсылка - Узел плана обмена, в который требуется выгрузить данные.
//
// СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки
//                                 события.
//  Если в теле процедуры-обработчика установить данному параметру значение Ложь, стандартная обработка события
//  производиться не будет.
//  Отказ от стандартной обработки не отменяет действие.
//  Значение по умолчанию - Истина.
//
Процедура РегистрацияИзмененияДляНачальнойВыгрузкиДанных(Получатель, СтандартнаяОбработка, Отбор)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Отбор) Тогда
		ОтборПоМетаданнымДляРегистрации = Неопределено;
	ИначеЕсли ТипЗнч(Отбор) = Тип("Массив") Тогда
		ОтборПоМетаданнымДляРегистрации = Отбор;
	Иначе
		ОтборПоМетаданнымДляРегистрации = Новый Массив;
		ОтборПоМетаданнымДляРегистрации.Добавить(Отбор);
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель,
			"ИспользоватьОтборПоОрганизациям,Организации,
			|ДатаНачалаВыгрузкиДокументов,
			|ОтправлятьВедомости,ОтправлятьВедомостиКакЗаявки,ОтправлятьРегламентированныеОтчеты,ОтправлятьСотрудников,
			|ОтправлятьВсехФизическихЛиц,ОтправлятьБухучет,ОтправлятьСтатистикуПерсонала,ОтправлятьУдержанныйНДФЛ,
			|ОтправлятьРезервы,ОтправлятьВидыРабот,ОтправлятьВсеДолжности,ОтправлятьРегистрацииНО,ОтправлятьСтруктуруПредприятия,
			|ВариантНастройки,
			|ПравилаОтправкиСправочников,ПравилаОтправкиДокументов");
	Организации = ?(ЗначенияРеквизитов.ИспользоватьОтборПоОрганизациям,
			ЗначенияРеквизитов.Организации.Выгрузить().ВыгрузитьКолонку("Организация"), Неопределено);
			
	ЕстьОтборПоОрганизациям = (Организации <> Неопределено);
	ДатаНачалаВыгрузкиДокументов = ЗначенияРеквизитов.ДатаНачалаВыгрузкиДокументов;
	
	ОтборДляРегистрацииИзменений = Новый Массив();
	
	Если ЗначенияРеквизитов.ПравилаОтправкиСправочников <> "НеСинхронизировать"
		ИЛИ ЗначенияРеквизитов.ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация" Тогда
		
		// Сразу исключим объекты, которые выгружаются при необходимости, или
		// не выгружаются при указанном варианте обмена.
		// Это ускорит начальную выгрузку.
		ОтборВыгружатьПриНеобходимости = Новый Массив;
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.ПодразделенияОрганизаций);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.СпособыОтраженияЗарплатыВБухУчете);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.Пользователи);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.ФИОФизическихЛиц);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.ДокументыФизическихЛиц);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.ШтатноеРасписание);
		ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия);
		
		Если Не ЗначенияРеквизитов.ОтправлятьВсехФизическихЛиц Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.ФизическиеЛица);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьВедомости Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыПеречислением);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьПрочихДоходовВБанк);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьПрочихДоходовВКассу);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ВедомостьПрочихДоходовПеречислением);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьВедомостиКакЗаявки Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ПлатежноеПоручение);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьРегламентированныеОтчеты Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.РегламентированныйОтчет);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьСотрудников Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.Сотрудники);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.КадроваяИсторияСотрудников);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.ВидыЗанятостиСотрудников);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьБухучет Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ОтражениеЗарплатыВБухучете);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьСтатистикуПерсонала Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ОтражениеСтатистикиПерсоналаВБухучете);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьУдержанныйНДФЛ Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.ОтражениеУдержанногоНДФЛВБухучете);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьРезервы Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.РезервыПоОплатеТруда);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.НастройкиРасчетаРезервовПоОплатеТруда);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.Резервы);
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.РегистрыСведений.НастройкиРасчетаРезервовОтпусков);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьВидыРабот Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.ВидыРаботСотрудников);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьВсеДолжности Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.Должности);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьРегистрацииНО Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.РегистрацииВНалоговомОргане);
		КонецЕсли;
		Если Не ЗначенияРеквизитов.ОтправлятьСтруктуруПредприятия Тогда
			ОтборВыгружатьПриНеобходимости.Добавить(Метаданные.Справочники.СтруктураПредприятия);
		КонецЕсли;
		
		ИмяПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Получатель);
		СоставПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав;
		
		Для Каждого ЭлементСоставаПланаОбмена Из СоставПланаОбмена Цикл 
			
			Если ОтборПоМетаданнымДляРегистрации <> Неопределено
				И ОтборПоМетаданнымДляРегистрации.Найти(ЭлементСоставаПланаОбмена.Метаданные) = Неопределено
				Или ОтборВыгружатьПриНеобходимости.Найти(ЭлементСоставаПланаОбмена.Метаданные) <> Неопределено Тогда
				// Передан отбор по метаданным, и текущий элемент метаданных в него не входит.
				// Или элемент метаданных входит в выгружаемые при необходимости.
				// Нужно его пропустить.
				Продолжить;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЭтоСправочник(ЭлементСоставаПланаОбмена.Метаданные) Тогда
				
				Если ЗначенияРеквизитов.ПравилаОтправкиСправочников = "АвтоматическаяСинхронизация" Тогда
					ОтборДляРегистрацииИзменений.Добавить(ЭлементСоставаПланаОбмена.Метаданные);
				Иначе
					
					Если ЭлементСоставаПланаОбмена.Метаданные.Имя = "Организации"
						И ЗначенияРеквизитов.ПравилаОтправкиСправочников = "СинхронизироватьПоНеобходимости" Тогда
						
						ОтборДляРегистрацииИзменений.Добавить(ЭлементСоставаПланаОбмена.Метаданные);
						
					КонецЕсли;
				
				КонецЕсли;
				
			ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ЭлементСоставаПланаОбмена.Метаданные) Тогда
				
				Если ЗначенияРеквизитов.ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация" Тогда
					ОтборДляРегистрацииИзменений.Добавить(ЭлементСоставаПланаОбмена.Метаданные);
				КонецЕсли;
				
			ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ЭлементСоставаПланаОбмена.Метаданные) Тогда
				
				Если ЗначенияРеквизитов.ПравилаОтправкиСправочников = "АвтоматическаяСинхронизация" Тогда
					ОтборДляРегистрацииИзменений.Добавить(ЭлементСоставаПланаОбмена.Метаданные);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОтборДляРегистрацииИзменений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Не ЕстьОтборПоОрганизациям);
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузкиДокументов", ДатаНачалаВыгрузкиДокументов);
	
	Для Каждого ОбъектМетаданных Из ОтборДляРегистрацииИзменений Цикл
		
		ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
		
		Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
			
			Если ОбъектМетаданных = Метаданные.Справочники.Организации Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Организации.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Организации КАК Организации
				|ГДЕ
				|	(&ПоВсемОрганизациям
				|			ИЛИ Организации.Ссылка В (&Организации))
				|	И НЕ Организации.Предопределенный";
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
				КонецЦикла;
				
			ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Сотрудники Тогда
				
				Выборка = ВыборкаСотрудниковПоОрганизациям(Организации, ЕстьОтборПоОрганизациям);
				Пока Выборка.Следующий() Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
				КонецЦикла;
				
			Иначе
				
				ИмяПоляОрганизация = "";
				Если ЕстьОтборПоОрганизациям Тогда
					Если ОбъектМетаданных.Реквизиты.Найти("Организация") <> Неопределено Тогда
						ИмяПоляОрганизация = "Организация";
					ИначеЕсли ОбъектМетаданных.Реквизиты.Найти("Владелец") <> Неопределено 
						И Тип(ОбъектМетаданных.Реквизиты.Найти("Владелец").Тип) = Тип("СправочникСсылка.Организации") Тогда
						ИмяПоляОрганизация = "Владелец";
					КонецЕсли;
				КонецЕсли;
				
				Если ПустаяСтрока(ИмяПоляОрганизация) Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Получатель, ОбъектМетаданных);
				Иначе
					Выборка = ВыборкаСправочниковПоОрганизациям(ОбъектМетаданных, Организации, ИмяПоляОрганизация);
					Пока Выборка.Следующий() Цикл
						ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда	
			
			Выборка = ВыборкаДокументовПоОрганизациям(ОбъектМетаданных, Организации, ДатаНачалаВыгрузкиДокументов);
			Пока Выборка.Следующий() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
			КонецЦикла;
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
			
			Если ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
				
				Если ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
					
					ЕстьОсновнойОтборПоОрганизации = Ложь;
					ОсновнойОтбор = Неопределено;
					Если ЕстьОтборПоОрганизациям Тогда
						ОсновнойОтбор = ОсновнойОтборРегистраСведений(ОбъектМетаданных);
						ЕстьОсновнойОтборПоОрганизации = (ОсновнойОтбор.Найти("Организация") <> Неопределено);
					КонецЕсли;
					
					Если ЕстьОсновнойОтборПоОрганизации Тогда
						Выборка = ВыборкаЗначенийОсновногоОтбораРегистраСведенийПоОрганизациям(ОсновнойОтбор, ПолноеИмяОбъекта, Организации);
						НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).СоздатьНаборЗаписей();
						Пока Выборка.Следующий() Цикл
							Для Каждого ИмяИзмерения Из ОсновнойОтбор Цикл
								НаборЗаписей.Отбор[ИмяИзмерения].Значение = Выборка[ИмяИзмерения];
								НаборЗаписей.Отбор[ИмяИзмерения].Использование = Истина;
							КонецЦикла;
							ПланыОбмена.ЗарегистрироватьИзменения(Получатель, НаборЗаписей);
						КонецЦикла;
					Иначе
						ПланыОбмена.ЗарегистрироватьИзменения(Получатель, ОбъектМетаданных);
					КонецЕсли;
					
				ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников
					Или ОбъектМетаданных = Метаданные.РегистрыСведений.ВидыЗанятостиСотрудников Тогда
					
					Если ЕстьОтборПоОрганизациям Тогда
						Регистраторы = РегистраторыПоОрганизациям(ОбъектМетаданных, Организации);
						Для каждого Регистратор Из Регистраторы Цикл
							НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).СоздатьНаборЗаписей();
							НаборЗаписей.Отбор["Регистратор"].Значение = Регистратор;
							НаборЗаписей.Отбор["Регистратор"].Использование = Истина;
							ПланыОбмена.ЗарегистрироватьИзменения(Получатель, НаборЗаписей);
						КонецЦикла;
					Иначе
						ПланыОбмена.ЗарегистрироватьИзменения(Получатель, ОбъектМетаданных);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыборкаДокументовПоОрганизациям(ОбъектМетаданных, Организации, ДатаНачалаВыгрузкиДокументов)
	
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	ИмяОтбораПоДате = "";
	Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументов) Тогда
		ИмяОтбораПоДате = "Дата";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПолноеИмяОбъекта КАК Таблица
	|ГДЕ
	|	Таблица.Организация В(&Организации)
	|	И ИСТИНА
	|	И &УсловиеПроведен";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	Если Не ПустаяСтрока(ИмяОтбораПоДате) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Истина", "И Таблица."+ИмяОтбораПоДате+" >= &ДатаНачалаВыгрузкиДокументов");
	КонецЕсли;
	
	Если Организации = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Таблица.Организация В(&Организации)", "Истина");	
	КонецЕсли;
	
	Если ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеПроведен", "И Таблица.Проведен");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеПроведен", "И НЕ Таблица.ПометкаУдаления");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузкиДокументов", ДатаНачалаВыгрузкиДокументов);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыборкаСправочниковПоОрганизациям(ОбъектМетаданных, Организации, ИмяПоляОрганизация)

	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПолноеИмяОбъекта КАК Таблица
	|ГДЕ
	|	Таблица.Организация В(&Организации)
	|	И НЕ Таблица.ПометкаУдаления";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таблица.Организация", "Таблица."+ИмяПоляОрганизация);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ОсновнойОтборРегистраСведений(ОбъектМетаданных)
	
	Результат = Новый Массив;
	
	Если ОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
		И ОбъектМетаданных.ОсновнойОтборПоПериоду Тогда
		Результат.Добавить("Период");
	КонецЕсли;
	
	Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
		Если Измерение.ОсновнойОтбор Тогда
			Результат.Добавить(Измерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВыборкаЗначенийОсновногоОтбораРегистраСведенийПоОрганизациям(ОсновнойОтбор, ПолноеИмяОбъекта, Организации)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	[Измерения]
	|ИЗ
	|	[ПолноеИмяОбъекта] КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Организация В(&Организации)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ПолноеИмяОбъекта]", ПолноеИмяОбъекта);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[Измерения]", СтрСоединить(ОсновнойОтбор, ","));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция РегистраторыПоОрганизациям(ОбъектМетаданных, ИсходныеОрганизации)
	
	Регистраторы = Новый Массив;
	ПолноеИмяОбъекта = ОбъектМетаданных.ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Регистратор КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(Таблица.Регистратор) КАК ТипДокумента
	|ИЗ
	|	#ПолноеИмяОбъекта КАК Таблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипДокумента";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДокументыПоТипам = Новый Соответствие;
	Пока Выборка.СледующийПоЗначениюПоля("ТипДокумента") Цикл
		ТипДокумента = Выборка.ТипДокумента;
		ДокументыПоТипу = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ДокументыПоТипу.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ДокументыПоТипам.Вставить(ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументыПоТипу[0]), ДокументыПоТипу);
	КонецЦикла;
	
	ГоловныеОрганизации = Новый Соответствие;
	Для каждого Организация Из ИсходныеОрганизации Цикл
		ГоловныеОрганизации.Вставить(ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	КонецЦикла;
	ГоловныеОрганизации = ОбщегоНазначенияБЗККлиентСервер.КлючиСоответствия(ГоловныеОрганизации);
	Запрос.УстановитьПараметр("ГоловныеОрганизации", ГоловныеОрганизации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация В(&ГоловныеОрганизации)
	|	И НЕ Организации.ПометкаУдаления";
	Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для каждого Организация Из ГоловныеОрганизации Цикл
		Если Организации.Найти(Организация) = Неопределено Тогда
			Организации.Добавить(Организация);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ИмяТаблицы КАК Таблица
	|ГДЕ
	|	Таблица.Организация В(&Организации)
	|	И Таблица.Ссылка В(&Документы)";
	
	Запрос.УстановитьПараметр("Организации", Организации);
	Для каждого КлючИЗначение Из ДокументыПоТипам Цикл
		Запрос.УстановитьПараметр("Документы", КлючИЗначение.Значение);
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", КлючИЗначение.Ключ);
		РегистраторыПоТипу = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Регистраторы, РегистраторыПоТипу);
	КонецЦикла;
	
	Возврат Регистраторы;

КонецФункции

Функция ВыборкаСотрудниковПоОрганизациям(ИсходныеОрганизации, ЕстьОтборПоОрганизациям)
	
	Если ЕстьОтборПоОрганизациям Тогда
		
		ГоловныеОрганизации = Новый Соответствие;
		Для каждого Организация Из ИсходныеОрганизации Цикл
			ГоловныеОрганизации.Вставить(ЗарплатаКадры.ГоловнаяОрганизация(Организация));
		КонецЦикла;
		ГоловныеОрганизации = ОбщегоНазначенияБЗККлиентСервер.КлючиСоответствия(ГоловныеОрганизации);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГоловныеОрганизации", ГоловныеОрганизации);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация В(&ГоловныеОрганизации)";
		РезультатЗапроса = Запрос.Выполнить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выбрать();

КонецФункции

Функция СравнитьВерсии(СтрокаВерсии1,СтрокаВерсии2) Экспорт
	// Сравнить две строки версий.
	//
	// Параметры:
	//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.
	//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
	//
	// Возвращаемое значение:
	//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
	//
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0", СтрокаВерсии2);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 2 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 2 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 1 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОбменЗУПБП(ВариантНастройки) Экспорт

	Возврат ВариантНастройки = ВариантНастройкиОбменаБП();

КонецФункции

#Область ПравилаРегистрацииОбъектов

Процедура КадровыеДанныеПослеОбработкиПравила(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели) Экспорт
	
	Если Получатели.Количество() > 0 Тогда
		
		Регистратор = Объект.Отбор.Регистратор.Значение;
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "Организация");
		Организации = ОрганизацииОтбора(Организация);
		
		Получатели = ПолучателиОрганизаций(Получатели, Организации);
		
	КонецЕсли;

КонецПроцедуры

Процедура СотрудникиПослеОбработкиПравила(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели) Экспорт

	Если Получатели.Количество() > 0 Тогда
		
		Организация = Объект.ГоловнаяОрганизация;
		Организации = ОрганизацииОтбора(Организация);
		
		Получатели = ПолучателиОрганизаций(Получатели, Организации);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучателиОрганизаций(Получатели, Организации)
	
	Если Не ЗначениеЗаполнено(Организации) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Получатели", Получатели);
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Организации КАК ПланОбменаОрганизации
	|		ПО ПланОбменаОсновнаяТаблица.Ссылка = ПланОбменаОрганизации.Ссылка
	|ГДЕ
	|	(ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоОрганизациям = ЛОЖЬ
	|			ИЛИ ПланОбменаОрганизации.Организация В (&Организации))
	|	И ПланОбменаОсновнаяТаблица.Ссылка В(&Получатели)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ОрганизацииОтбора(Организация)
	
	Организации = Новый Массив;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Организации;
	КонецЕсли;
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	Организации = ОбменДаннымиУниверсальныйФорматПовтИсп.ФилиалыГоловнойОрганизации(ГоловнаяОрганизация);
	Если Организации.Найти(Организация) = Неопределено Тогда
		Организации.Добавить(Организация);
	КонецЕсли;
	
	Возврат Организации;
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыВариантовНастройкиОбмена

Функция ВариантНастройкиОбменаERP() Экспорт

	Возврат "ОбменУП2ЗУП3";

КонецФункции

Функция ВариантНастройкиОбменаБП() Экспорт

	Возврат "ОбменЗУПБП";

КонецФункции

Функция ВариантНастройкиОбменУниверсальный() Экспорт

	Возврат "ОбменУниверсальный";

КонецФункции

Функция ВариантНастройкиОбменаДО() Экспорт

	Возврат "ОбменЗКДО";

КонецФункции

Функция ВариантНастройкиОбменаУНФ() Экспорт

	Возврат "ОбменЗУПУНФ";

КонецФункции

#КонецОбласти

Функция ЭтоОбменЗУПERP(ВариантНастройки) Экспорт

	Возврат ВариантНастройки = ВариантНастройкиОбменаERP();

КонецФункции

Функция ЭтоОбменЗУПДО(ВариантНастройки) Экспорт

	Возврат ВариантНастройки = ВариантНастройкиОбменаДО();

КонецФункции

Функция ЭтоОбменЗУПУНФ(ВариантНастройки) Экспорт

	Возврат ВариантНастройки = ВариантНастройкиОбменаУНФ();

КонецФункции

Функция ЭтоОбменУниверсальный(ВариантНастройки) Экспорт

	Возврат ВариантНастройки = ВариантНастройкиОбменУниверсальный();

КонецФункции

#КонецОбласти
